toddfries/OpenBSD-usr.sbin-patches/btctl/bt.conf.5
.\"	$OpenBSD: bt.conf.5,v 1.3 2008/12/06 22:51:01 sobrado Exp $
.\"
.\" Copyright (c) 2008 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 6 2008 $
.Dt BT.CONF 5
.Os
.Sh NAME
.Nm bt.conf
.Nd bluetooth configuration file
.Sh DESCRIPTION
.Nm
is the configuration file for the bluetooth daemon,
.Xr btd 8 ,
and specifies interface and device attachments for bluetooth devices.
.Pp
Lines beginning with
.Sq #
and empty lines are regarded as comments,
and ignored.
.\" Lines may be split using the
.\" .Sq \e
.\" character.
.Pp
The syntax is as follows:
.Bl -tag -width xxxx
.It Xo
.Ic attach Ar mac
.Ic type Ar typename
.Ic pin Ar pincode
.Xc
Attach a bluetooth device.
.Ar mac
specifies the MAC address of the device.
If
.Sq *
is given, all devices are matched.
.Ar typename
describes the type of device to attach.
Possible
.Ar typename
values are:
.Pp
.Bl -tag -width "noneXXX" -offset indent -compact
.It none
A catchall.
.It hf
Hands Free.
.It hid
Keyboard/Mouse.
.It hset
Handset.
.El
.Pp
.Ar pincode
describes the pin number used to pair with the device.
The
.Ar pincode
must be specified in quotes.
.It Xo
.Ic interface
.Ar mac
.Ar args
.Xc
Specify an interface to listen on.
.Ar mac
is the interface MAC address.
If
.Sq *
is given, all interfaces are matched.
.Ar args
is either
.Ar name
.Pq the interface name
or
.Ar disable
to prevent an interface from being used.
.El
.Sh EXAMPLES
.Bd -literal -offset indent
# Enable all interfaces.
interface * "OpenBSD BT"
# Attach a keyboard and/or mouse,
# or a mobile phone emulating such things.
attach 00:02:76:08:1c:37 type hid pin "0000"
.Ed
.Sh SEE ALSO
.Xr sbt 4 ,
.Xr ubt 4 ,
.Xr btctl 8 ,
.Xr btd 8
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 4.5 .
